Revit 2024 API
BuiltInFailures.StairRampFailures.BadRailingsError Property
 Can't create Railings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BadRailingsError { get; }
Visual Basic
Public Shared ReadOnly Property BadRailingsError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BadRailingsError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace